БухЭксп/DataProcessors/CW_ФормированиеДокументовУчетаГСМвБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_ФормированиеДокументовУчетаГСМвБУ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппаДельта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеремещений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНакладных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

БухЭксп/Documents/CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_РасходыПоГрузоперевозкамТранспортныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутевойЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутевойЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего_Валюта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/DataProcessors/CW_ФормированиеДокументовУчетаГСМвБУ/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВестиУчетЗатратПоПодразделениям    		= ПолучитьФункциональнуюОпцию("ВестиУчетЗатратПоПодразделениям");
	//Для версии КОРП
	ВестиУчетПоПодразделениям          			= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");  
	Элементы.ПодразделениеОрганизации.Видимость = ВестиУчетПоПодразделениям;
	//Для версии КОРП
	
	ФормироватьРазныеДокументыПоВидуРасхода = Истина;

	ПолучитьКонтрольОтрицательныйостатков();
	УстановитьЗаголовокНадписиКонтроляОстатков();
	
	ПроверитьИПолучитьДополнительныеСвойства(Отказ);

	Элементы.ИсходныеДанныеПеремещениеГруппаПодразделение.Видимость = ВестиУчетПоПодразделениям;
	Элементы.ИсходныеДанныеЗарплатаПодразделение.Видимость 			= ВестиУчетЗатратПоПодразделениям или ВестиУчетПоПодразделениям;
	
	ПериодФормирования.ДатаНачала 		= НачалоМесяца(ТекущаяДата());
	ПериодФормирования.ДатаОкончания 	= КонецМесяца(ТекущаяДата());
	ДатаНакладных 						= КонецМесяца(ТекущаяДата());
	ДатаПеремещений 					= КонецМесяца(ТекущаяДата()) - 10;
	Организация 						= CW_Настройки.ОсновнаяОрганизация();
	
	СтатьяЗатрат 						= Константы.CW_СтатьяЗатратСписанияТопливаПоПутевымЛистам.Получить();
	
	УстановитьВидимостьЭлементовФормы();
	ОбработатьВыборОрганизации();
	
	ОбработатьИзменениеПериода();
	
	УстановитьДоступностьКнопокСформировать();
	
	Элементы.ИсходныеДанныеЗарплатаГруппа4.Видимость = Ложь;


КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Отказ 				= ЗавершениеРаботы;
	ТекстПредупреждения = "Необходимо закрыть форму обработки формирования документов учета ГСМ!";
	
	Если ПроверитьНаличиеДокументовПриЗакрытии  Тогда
		
		Если Не ЗавершениеРаботы тогда
			
			ОбработатьОповещения();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьДоступностьКнопокСформировать()
	
	Элементы.НоменклатураКПеремещениюСформироватьПеремещения.Доступность 	= ИсходныеДанныеПеремещение.Количество() > 0;
	Элементы.ИсходныеДанныеСписаниеСформироватьНакладные.Доступность 		= ИсходныеДанныеСписаниеНаФорме.Количество() > 0;
	Элементы.ИсходныеДанныеЗарплатаСформироватьОперацию.Доступность 		= ИсходныеДанныеЗарплата.Количество() > 0;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьКонтрольОтрицательныйостатков()
	
	КонтрольОтрицательныхОстатков = Константы.ОтключитьКонтрольОтрицательныхОстатков.Получить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокНадписиКонтроляОстатков()
	
	Элементы.НадписьОткрытьФормуНастроек.Заголовок = ?(КонтрольОтрицательныхОстатков, "Выключен","Включен");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПериодДинамическихСписков()
	
	ЗаполнитьЗначенияСвойств(Элементы.СписокПеремещениеТоваров.Период	, ПериодФормирования);
	ЗаполнитьЗначенияСвойств(Элементы.СписокТребованиеНакладная.Период	, ПериодФормирования);
	ЗаполнитьЗначенияСвойств(Элементы.СписокДокументовОперациБух.Период	, ПериодФормирования);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИПолучитьДополнительныеСвойства(Отказ)
	
	ДополнительноеСвоствоПеремещения 	= Константы.CW_ДополнительноеСвойствоДокументаПеремещениеТоваров.Получить();
	ДополнительноеСвоствоТребование  	= Константы.CW_ДополнительноеСвойствоДокументаТребованиеНакладная.Получить();
	ДополнительноеСвоствоОперацияБух  	= Константы.CW_ДополнительноеСвойствоДокументаОперацияВведеннаяВручную.Получить();
	
	Если не ЗначениеЗаполнено(ДополнительноеСвоствоПеремещения) тогда
		//Формируем новое совойство
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ИмяНабораСвойств"	, "Документ_ПеремещениеТоваров");
		СтруктураДанных.Вставить("Наименование"		, "Сформирован обработкой учета ГСМ (Перемещение товаров)");
		СтруктураДанных.Вставить("Заголовок"		, "Сформирован обработкой учета ГСМ");
		СтруктураДанных.Вставить("Имя"				, "СформированОбработкойУчетаГСМ_");
		СтруктураДанных.Вставить("ИмяКонстанты"		, "CW_ДополнительноеСвойствоДокументаПеремещениеТоваров");
		
		Ответ = CW_УчетСобственногоТранспортаСервер.СоздатьИЗаписатьСвойствоДокумента(СтруктураДанных);
		
		Если Ответ.Успешно Тогда
			ДополнительноеСвоствоПеремещения = ПолучитьИзВременногоХранилища(Ответ.АдресЗначения);
			Константы.CW_ДополнительноеСвойствоДокументаПеремещениеТоваров.Установить(ДополнительноеСвоствоПеремещения);
		КонецЕсли;
		
		Отказ = Не Ответ.Успешно;
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		Если не ЗначениеЗаполнено(ДополнительноеСвоствоТребование) тогда
			//Формируем новое совойство
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("ИмяНабораСвойств"	, "Документ_ТребованиеНакладная");
			СтруктураДанных.Вставить("Наименование"		, "Сформирован обработкой учета ГСМ (Требование-накладная)");
			СтруктураДанных.Вставить("Заголовок"		, "Сформирован обработкой учета ГСМ");
			СтруктураДанных.Вставить("Имя"				, "СформированОбработкойУчетаГСМ_");
			СтруктураДанных.Вставить("ИмяКонстанты"		, "CW_ДополнительноеСвойствоДокументаТребованиеНакладная");
			
			Ответ = CW_УчетСобственногоТранспортаСервер.СоздатьИЗаписатьСвойствоДокумента(СтруктураДанных);
			
			Если Ответ.Успешно Тогда
				ДополнительноеСвоствоТребование = ПолучитьИзВременногоХранилища(Ответ.АдресЗначения);
				Константы.CW_ДополнительноеСвойствоДокументаТребованиеНакладная.Установить(ДополнительноеСвоствоТребование);
			КонецЕсли;
			
			Отказ = Не Ответ.Успешно;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	//
	Если Не Отказ Тогда
		
		Если не ЗначениеЗаполнено(ДополнительноеСвоствоОперацияБух) тогда
			//Формируем новое совойство
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("ИмяНабораСвойств"	, "Документ_ОперацияБух");
			СтруктураДанных.Вставить("Наименование"		, "Сформирован обработкой учета ГСМ (Операция введенная вручную)");
			СтруктураДанных.Вставить("Заголовок"		, "Сформирован обработкой учета ГСМ");
			СтруктураДанных.Вставить("Имя"				, "СформированОбработкойУчетаГСМ_");
			СтруктураДанных.Вставить("ИмяКонстанты"		, "CW_ДополнительноеСвойствоДокументаОперацияВведеннаяВручную");
			
			Ответ = CW_УчетСобственногоТранспортаСервер.СоздатьИЗаписатьСвойствоДокумента(СтруктураДанных);
			
			Если Ответ.Успешно Тогда
				ДополнительноеСвоствоОперацияБух = ПолучитьИзВременногоХранилища(Ответ.АдресЗначения);
				Константы.CW_ДополнительноеСвойствоДокументаОперацияВведеннаяВручную.Установить(ДополнительноеСвоствоОперацияБух);
			КонецЕсли;
			
			Отказ = Не Ответ.Успешно;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическихСписков()    
	
	СписокПеремещениеТоваров.Отбор.Элементы.Очистить();
	СписокТребованиеНакладная.Отбор.Элементы.Очистить();
	СписокДокументовОперациБух.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ЭлементОтбора = СписокПеремещениеТоваров.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Организация;
		ЭлементОтбора.Использование = Истина; 
		
		ЭлементОтбора = СписокТребованиеНакладная.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Организация;
		ЭлементОтбора.Использование = Истина; 
		
		ЭлементОтбора = СписокДокументовОперациБух.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Организация;
		ЭлементОтбора.Использование = Истина; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Если СводноеПеремещение Тогда
		ТекстПодсказки = "Будет сформирован один документ ""Перемещение товаров"" на указанную дату";
		Элементы.ДатаПеремещений.Подсказка					= ТекстПодсказки;
		Элементы.СводноеПеремещение.Подсказка				= "";
	Иначе
		ТекстПодсказки = "Будут сформированы документы ""Перемещение товаров"" на каждую дату заправки";
		Элементы.ДатаПеремещений.Подсказка					= "";
		Элементы.СводноеПеремещение.Подсказка				= ТекстПодсказки;
	КонецЕсли;
	
	Элементы.ДатаПеремещений.Видимость 					= СводноеПеремещение;
	
	Элементы.ИсходныеДанныеПеремещениеКоличество.ТекстПодвала =  Формат(ИсходныеДанныеПеремещение.Итог("Количество"), "ЧДЦ=3") ;
	
	Элементы.ИсходныеДанныеЗарплатаСумма.ТекстПодвала   =  Формат(ИсходныеДанныеЗарплата.Итог("Сумма"), "ЧДЦ=2") ;
	Элементы.ИсходныеДанныеЗарплатаСуммаНУ.ТекстПодвала =  Формат(ИсходныеДанныеЗарплата.Итог("СуммаНУ"), "ЧДЦ=2") ;
	Элементы.ИсходныеДанныеЗарплатаСуммаПР.ТекстПодвала =  Формат(ИсходныеДанныеЗарплата.Итог("СуммаПР"), "ЧДЦ=2") ;
	Элементы.ИсходныеДанныеЗарплатаСуммаВР.ТекстПодвала =  Формат(ИсходныеДанныеЗарплата.Итог("СуммаВР"), "ЧДЦ=2") ;
	
	Элементы.ИсходныеДанныеСписаниеНаФормеКоличествоВсего.ТекстПодвала 			 =  Формат(ИсходныеДанныеСписаниеНаФорме.Итог("КоличествоВсего")			, "ЧДЦ=3") ;
	Элементы.ИсходныеДанныеСписаниеНаФормеКоличествоВПределахНормы.ТекстПодвала  =  Формат(ИсходныеДанныеСписаниеНаФорме.Итог("КоличествоВПределахНормы")	, "ЧДЦ=3") ;
	Элементы.ИсходныеДанныеСписаниеНаФормеКоличествоСверхНормы.ТекстПодвала		 =  Формат(ИсходныеДанныеСписаниеНаФорме.Итог("КоличествоСверхНормы")		, "ЧДЦ=3") ;

	
КонецПроцедуры

&НаКлиенте
Процедура ПериодФормированияПриИзменении(Элемент)
	
	ОбработатьИзменениеПериода();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПериода()
	
	ДатаНакладных 	= ПериодФормирования.ДатаОкончания;
	ДатаПеремещений = ДатаНакладных - 10;
	ДатаОперации 	= ПериодФормирования.ДатаОкончания;
	
	УстановитьПериодДинамическихСписков();
	
КонецПроцедуры

&НаСервере
Функция СпособУчетаНДСНоменклатуры(СпособУчета)
	Если ЗначениеЗаполнено(СпособУчета) Тогда
		Возврат СпособУчета;
	Иначе
		Возврат Перечисления.СпособыУчетаНДС.УчитываетсяВCтоимости;	
	КонецЕсли;
КонецФункции

&наСервере
Процедура ЗаписатьДополнителнительноеСвойствоДокумента(СсылкаНаДокумент)
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ТребованиеНакладная") Тогда
		Свойство = ДополнительноеСвоствоТребование;
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Свойство = ДополнительноеСвоствоПеремещения;
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ОперацияБух") Тогда
		Свойство = ДополнительноеСвоствоОперацияБух;
	Иначе
		//странно
		Возврат;
	КонецЕсли;
	
	Попытка
		Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		Запись.Объект 	= СсылкаНаДокумент;
		Запись.Свойство = Свойство;
		Запись.Прочитать();
		
		Запись.Объект 	= СсылкаНаДокумент;
		Запись.Свойство = Свойство;
		Запись.Значение = истина;
		Запись.Записать(истина);
		
	Исключение
		
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура КонтрольОборотов(Команда)
	
	ПараметрыОтчета = новый Структура;
	ПараметрыОтчета.Вставить("ВнешнийВызов"	, Истина);
	ПараметрыОтчета.Вставить("НачалоПериода", ПериодФормирования.ДатаНачала);
	ПараметрыОтчета.Вставить("КонецПериода"	, ПериодФормирования.ДатаОкончания);
	ПараметрыОтчета.Вставить("ВнешнийВызов"	, Истина);
	
	Если ЗначениеЗаполнено(Организация) тогда
		ПараметрыОтчета.Вставить("Отбор", Новый Структура("Организация", Организация));
	КонецЕсли;
	
	ОткрытьФорму("Отчет.CW_АнализСписанияТопливаПоВидамУчета.Форма.ФормаОтчета",ПараметрыОтчета,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СводноеПеремещениеПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура ДатаДокументовПриИзменении(Элемент)
	Объект.ДатаПеремещений = Объект.ДатаНакладных - 10;
КонецПроцедуры

//Перемещение топлива
&НаКлиенте
Процедура СформироватьПеремещения(Команда)
	
	Если СводноеПеремещение Тогда
		Отказ = ложь;
		Если Не ЗначениеЗаполнено(Объект.ДатаПеремещений) Тогда   
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата документов",,"ДатаПеремещений", "Объект", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПеремещения", ЭтаФорма);
	
	Если ЕстьПеремещенияТекущегоПпериода() тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "В указанном периоде есть документы ранее сформированные обработкой. Документы будут помечены на удаление. Продолжить?" , Режим, 0);		
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПеремещения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;   
	
	РезультатВыполнения =  СформироватьПеремещенияТопливаНаСервереВФоне();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПеремещенияТоплива", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры   

&НаКлиенте 
Процедура ОбработатьРезультатПеремещенияТоплива(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		Результат = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);   
		Если ТипЗнч(Результат) = Тип("Структура") 
			И Результат.Свойство(ПроверитьНаличиеДокументовПриЗакрытии)
			И Результат.ПроверитьНаличиеДокументовПриЗакрытии <> Неопределено Тогда
			
			ПроверитьНаличиеДокументовПриЗакрытии = Результат.ПроверитьНаличиеДокументовПриЗакрытии;	
			
		КонецЕсли;
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("ФиксированныйМассив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		Элементы.СписокПеремещениеТоваров.Обновить();
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("ФиксированныйМассив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования документов");  
		
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере 
Функция СформироватьПеремещенияТопливаНаСервереВФоне()  

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Формирование перемещенй топлива";  
	ПараметрыВыполнения.ЗапуститьВФоне     = Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне   = ложь;   
	
	ПараметрыПроцедуры = Новый Структура; 
	ПараметрыПроцедуры.Вставить("Организация", 					Организация);  
	ПараметрыПроцедуры.Вставить("ПодразделениеОрганизации", 	ПодразделениеОрганизации);  
	ПараметрыПроцедуры.Вставить("ДатаНачала", 					ПериодФормирования.ДатаНачала);  
	ПараметрыПроцедуры.Вставить("ДатаОкончания", 				ПериодФормирования.ДатаОкончания);  
	ПараметрыПроцедуры.Вставить("ДатаПеремещений", 				Объект.ДатаПеремещений);  
	ПараметрыПроцедуры.Вставить("СводноеПеремещение", 			СводноеПеремещение);  
	ПараметрыПроцедуры.Вставить("ВестиУчетПоПодразделениям", 	ВестиУчетПоПодразделениям);   
	ПараметрыПроцедуры.Вставить("ДополнительноеСвойство", 		ДополнительноеСвоствоПеремещения);   
	ПараметрыПроцедуры.Вставить("ВнешниеДанные", 				ИсходныеДанныеПеремещение.Выгрузить()); 
	ПараметрыПроцедуры.Вставить("ПровестиДокументыПеремещения", ПровестиДокументыПеремещения);  
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_ФормированиеДокументовУчетаГСМвБУ.СформироватьПеремещенияТоплива",ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции
 //---Перемещение топлива

 
 //Списание топлива
&НаКлиенте
Процедура СформироватьНакладные(Команда)
	
	Отказ = ложь;
	Если Не ЗначениеЗаполнено(Объект.ДатаНакладных) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата документов",,"ДатаНакладных", "Объект", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаНакладные", ЭтаФорма);

	Если ЕстьНакладныеТекущегоПериода() тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "В указанном периоде есть документы ранее сформированные обработкой. Документы будут помечены на удаление. Продолжить?" , Режим, 0);		
	Иначе    
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;

КонецПроцедуры     

&НаКлиенте
Процедура ПослеЗакрытияВопросаНакладные(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  СформироватьНакладныеНаСервереВФоне();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатСписанияТоплива", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры 

&НаСервере 
Функция СформироватьНакладныеНаСервереВФоне()  

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Формирование списания топлива";  
	ПараметрыВыполнения.ЗапуститьВФоне     = Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне   = ложь;   
	
	ПараметрыПроцедуры = Новый Структура; 
	ПараметрыПроцедуры.Вставить("Организация", 						Организация);  
	ПараметрыПроцедуры.Вставить("ПодразделениеОрганизации", 		ПодразделениеОрганизации);  
	ПараметрыПроцедуры.Вставить("ДатаНачала", 						ПериодФормирования.ДатаНачала);  
	ПараметрыПроцедуры.Вставить("ДатаОкончания", 					ПериодФормирования.ДатаОкончания);  
	ПараметрыПроцедуры.Вставить("ДатаНакладных", 					Объект.ДатаНакладных);  
	ПараметрыПроцедуры.Вставить("ВестиУчетПоПодразделениям", 		ВестиУчетПоПодразделениям);   
	ПараметрыПроцедуры.Вставить("ВестиУчетЗатратПоПодразделениям", 	ВестиУчетЗатратПоПодразделениям);   
	ПараметрыПроцедуры.Вставить("ДополнительноеСвойство", 			ДополнительноеСвоствоТребование);   
	ПараметрыПроцедуры.Вставить("ВнешниеДанные", 					ИсходныеДанныеСписание.Выгрузить()); 
	ПараметрыПроцедуры.Вставить("ПровестиДокументыНакладные", 		ПровестиДокументыНакладные);  
	ПараметрыПроцедуры.Вставить("ФормироватьРазныеДокументыПоВидуРасхода", ФормироватьРазныеДокументыПоВидуРасхода);  
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_ФормированиеДокументовУчетаГСМвБУ.СформироватьТребованияНакладные", ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции  

&НаКлиенте 
Процедура ОбработатьРезультатСписанияТоплива(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		Результат = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);   
		Если ТипЗнч(Результат) = Тип("Структура") 
			И Результат.Свойство(ПроверитьНаличиеДокументовПриЗакрытии)
			И Результат.ПроверитьНаличиеДокументовПриЗакрытии <> Неопределено Тогда
			
			ПроверитьНаличиеДокументовПриЗакрытии = Результат.ПроверитьНаличиеДокументовПриЗакрытии;	
			
		КонецЕсли;
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("ФиксированныйМассив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
	
		Элементы.СписокТребованиеНакладная.Обновить();
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("ФиксированныйМассив") Тогда
			
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
			
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования документов");  
		
	КонецЕсли;  
	
КонецПроцедуры
 //---Списание топлива

//Распределение зарплаты
&НаКлиенте
Процедура СформироватьОперацию(Команда)
	
	Отказ = ложь;
	Если Не ЗначениеЗаполнено(Объект.ДатаОперации) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата формирования операций",,"ДатаОперации", "Объект", Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.НоменклатурнаяГруппаДельта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана номенклатурная группа для отнесения разницы сумма ОУ и БУ!",,"НоменклатурнаяГруппаДельта", "Объект", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОперацииБух", ЭтаФорма, Параметры);

	Если ЕстьОперацииТекущегоПпериода() тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "В указанном периоде есть документы ранее сформированные обработкой. Документы будут помечены на удаление. Продолжить?" , Режим, 0);		
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОперацииБух(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  СформироватьОперацииНаСервереВФоне();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатРаспределенияЗарплаты", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры 

&НаСервере 
Функция СформироватьОперацииНаСервереВФоне()  

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Распределение зарплаты водителей";  
	ПараметрыВыполнения.ЗапуститьВФоне     = Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне   = ложь;   
	
	ПараметрыПроцедуры = Новый Структура; 
	ПараметрыПроцедуры.Вставить("Организация",				Организация);  
	ПараметрыПроцедуры.Вставить("ДатаНачала",				ПериодФормирования.ДатаНачала);  
	ПараметрыПроцедуры.Вставить("ДатаОкончания",			ПериодФормирования.ДатаОкончания); 
 	ПараметрыПроцедуры.Вставить("ДатаОперации",				Объект.ДатаОперации);  
 	ПараметрыПроцедуры.Вставить("УчетПоПодразделениям",		ВестиУчетПоПодразделениям или ВестиУчетЗатратПоПодразделениям);   
  	ПараметрыПроцедуры.Вставить("ДополнительноеСвойство",	ДополнительноеСвоствоОперацияБух);   
 	ПараметрыПроцедуры.Вставить("НоменклатурнаяГруппаДельта", Объект.НоменклатурнаяГруппаДельта);  
	ПараметрыПроцедуры.Вставить("ВнешниеДанные",			ИсходныеДанныеЗарплата.Выгрузить()); 
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_ФормированиеДокументовУчетаГСМвБУ.СформироватьОперацииРаспределенияЗарплаты", ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции  

&НаКлиенте 
Процедура ОбработатьРезультатРаспределенияЗарплаты(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		Результат = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);   
		Если ТипЗнч(Результат) = Тип("Структура") 
			И Результат.Свойство(ПроверитьНаличиеДокументовПриЗакрытии)
			И Результат.ПроверитьНаличиеДокументовПриЗакрытии <> Неопределено Тогда
			
			ПроверитьНаличиеДокументовПриЗакрытии = Результат.ПроверитьНаличиеДокументовПриЗакрытии;	
			
		КонецЕсли;
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("ФиксированныйМассив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
	
		Элементы.СписокДокументовОперациБух.Обновить();
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("ФиксированныйМассив") Тогда
			
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
			
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования документов");  
		
	КонецЕсли;  
	
КонецПроцедуры
//---Распределение зарплаты


&НаКлиенте
Процедура КомандаЗаполнитьТопливоКПеремещению(Команда)

	ПараметрыПроцедуры = СтруктураПолучаемыхДанных();
	ПараметрыПроцедуры.ПеремещенияТоплива = Истина;
	
	РезультатВыполнения =  ПолучитьИсходныеДанныеНаСервереВФоне(ПараметрыПроцедуры);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("РезультатПолученияИсходныхДанных", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьТопливоКСписанию(Команда)
	
	ПараметрыПроцедуры = СтруктураПолучаемыхДанных();
	ПараметрыПроцедуры.СписанияТоплива = Истина;
	
	РезультатВыполнения =  ПолучитьИсходныеДанныеНаСервереВФоне(ПараметрыПроцедуры);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("РезультатПолученияИсходныхДанных", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры 

&НаКлиенте
Процедура КомандаЗаполнитьДанныеЗаработнойПлаты(Команда)
	
	ПараметрыПроцедуры = СтруктураПолучаемыхДанных();
	ПараметрыПроцедуры.ЗаработнаяПлата = Истина;
	
	РезультатВыполнения =  ПолучитьИсходныеДанныеНаСервереВФоне(ПараметрыПроцедуры);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("РезультатПолученияИсходныхДанных", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры    

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбработатьВыборОрганизации();

	ПараметрыПроцедуры = СтруктураПолучаемыхДанных();
	ПараметрыПроцедуры.ПеремещенияТоплива 	= Истина;
	ПараметрыПроцедуры.СписанияТоплива 		= Истина;
	ПараметрыПроцедуры.ЗаработнаяПлата 		= Истина;
	
	РезультатВыполнения =  ПолучитьИсходныеДанныеНаСервереВФоне(ПараметрыПроцедуры);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("РезультатПолученияИсходныхДанных", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 

КонецПроцедуры

&НаСервере 
Функция ПолучитьИсходныеДанныеНаСервереВФоне(ПараметрыПроцедуры)  
	
	ПараметрыПроцедуры.Вставить("ДатаНачала",			ПериодФормирования.ДатаНачала);  
	ПараметрыПроцедуры.Вставить("ДатаОкончания", 		ПериодФормирования.ДатаОкончания); 
	ПараметрыПроцедуры.Вставить("Организация", 			Организация);  
	ПараметрыПроцедуры.Вставить("ВестиУчетЗатратПоПодразделениям",	ВестиУчетЗатратПоПодразделениям);  
	ПараметрыПроцедуры.Вставить("ВестиУчетПоПодразделениям",		ВестиУчетПоПодразделениям);  
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Получение исходных данных для учета ГСМ";  
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне = ложь;   
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_ФормированиеДокументовУчетаГСМвБУ.ПолучитьИсходныеДанные",ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции  

 &НаКлиенте 
Процедура РезультатПолученияИсходныхДанных(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда   
		
		ОбработатьРезультатПолученияИсходныхДанныхНаСервере(РезультатВыполнения.АдресРезультата);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
			
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Не удалось получить данные топлива к перемещению");  
		
	КонецЕсли;  

КонецПроцедуры   

&НаСервере
Процедура ОбработатьРезультатПолученияИсходныхДанныхНаСервере(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если Результат.Свойство("ПеремещенияТоплива") Тогда
			ИсходныеДанныеПеремещение.Загрузить(Результат.ПеремещенияТоплива);
		КонецЕсли;    
		
		Если Результат.Свойство("СписанияТоплива") Тогда
			
			ИсходныеДанныеСписание.Загрузить(Результат.СписанияТоплива.ИсходныеДанныеСписание);
			ИсходныеДанныеСписаниеНаФорме.Загрузить(Результат.СписанияТоплива.ИсходныеДанныеСписаниеНаФорме);
		КонецЕсли;   
		
		Если Результат.Свойство("ЗаработнаяПлата") Тогда
			
			ИсходныеДанныеЗарплата.Загрузить(Результат.ЗаработнаяПлата);
			
			Элементы.ИсходныеДанныеЗарплатаГруппа4.Видимость = 
				ИсходныеДанныеЗарплата.Итог("СуммаПР") <> 0 
				или ИсходныеДанныеЗарплата.Итог("СуммаВР" ) <> 0;
			
		КонецЕсли;  
		
	КонецЕсли;  
	
	УстановитьВидимостьЭлементовФормы();
	УстановитьДоступностьКнопокСформировать();  
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураПолучаемыхДанных()
	
	ПараметрыПроцедуры = Новый Структура;                                            
	ПараметрыПроцедуры.Вставить("ПеремещенияТоплива",	Ложь); 
	ПараметрыПроцедуры.Вставить("СписанияТоплива",		Ложь);    
	ПараметрыПроцедуры.Вставить("ЗаработнаяПлата",		Ложь);    
	
	Возврат ПараметрыПроцедуры;

КонецФункции  

&НаСервере
Процедура ОбработатьВыборОрганизации()
	
	ОтборПоОрганизацииВключен = ЗначениеЗаполнено(Организация);
	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерейтиВЖурналПеремещенияТоваров(Команда)
	
	ПараметрыФормы = ПолучитьПараметрыОткрытияФормы();
	
	ОткрытьФорму("Документ.ПеремещениеТоваров.ФормаСписка",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерейтиВЖурналТребованияНакладные(Команда)
	
	ПараметрыФормы = ПолучитьПараметрыОткрытияФормы();
	
	ОткрытьФорму("Документ.ТребованиеНакладная.ФормаСписка",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры   

&НаКлиенте
Процедура КомандаПерейтиВЖурналОперацияБух(Команда)
	
	ПараметрыФормы = ПолучитьПараметрыОткрытияФормы();
	
	ОткрытьФорму("Документ.ОперацияБух.ФормаСписка",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыОткрытияФормы()
	
	ПараметрыФормы = Новый Структура; 
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ПараметрыОтбора = Новый Структура("Организация", Организация);   
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); 
	КонецЕсли;  
	
	Возврат ПараметрыФормы;

КонецФункции


&НаКлиенте
Процедура НадписьОткрытьФормуНастроекНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыНастроек", ЭтаФорма);
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияБП.Форма.ПроведениеДокументов",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура  ВыполнитьПослеЗакрытияФормыНастроек(Резульат, Параметры) Экспорт

	ПолучитьКонтрольОтрицательныйостатков();
	УстановитьЗаголовокНадписиКонтроляОстатков();
	
КонецПроцедуры


&НаСервере
Функция ЕстьПеремещенияТекущегоПпериода()    
	
	ПараметрыПроцедуры = Новый Структура; 
	ПараметрыПроцедуры.Вставить("Организация", 					Организация);  
	ПараметрыПроцедуры.Вставить("ДатаНачала", 					ПериодФормирования.ДатаНачала);  
	ПараметрыПроцедуры.Вставить("ДатаОкончания", 				ПериодФормирования.ДатаОкончания);  
	ПараметрыПроцедуры.Вставить("ДополнительноеСвойство", 		ДополнительноеСвоствоПеремещения);   
	
	РезультатЗапроса = Обработки.CW_ФормированиеДокументовУчетаГСМвБУ.ПолучитьРезультатЗапросаПеремещений(ПараметрыПроцедуры);

	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции 

&НаСервере
Функция ЕстьНакладныеТекущегоПериода()
	
	ПараметрыПроцедуры = Новый Структура; 
	ПараметрыПроцедуры.Вставить("Организация", 					Организация);  
	ПараметрыПроцедуры.Вставить("ДатаНачала", 					ПериодФормирования.ДатаНачала);  
	ПараметрыПроцедуры.Вставить("ДатаОкончания", 				ПериодФормирования.ДатаОкончания);  
	ПараметрыПроцедуры.Вставить("ДополнительноеСвойство", 		ДополнительноеСвоствоТребование);   
	
	РезультатЗапроса = Обработки.CW_ФормированиеДокументовУчетаГСМвБУ.ПолучитьРезультатЗапросаТребованияНакладная(ПараметрыПроцедуры);
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции  

&НаСервере
Функция ЕстьОперацииТекущегоПпериода()
	
	ПараметрыПроцедуры = Новый Структура; 
	ПараметрыПроцедуры.Вставить("Организация", 					Организация);  
	ПараметрыПроцедуры.Вставить("ДатаНачала", 					ПериодФормирования.ДатаНачала);  
	ПараметрыПроцедуры.Вставить("ДатаОкончания", 				ПериодФормирования.ДатаОкончания);  
	ПараметрыПроцедуры.Вставить("ДополнительноеСвойство", 		ДополнительноеСвоствоОперацияБух);   
	
	РезультатЗапроса = Обработки.CW_ФормированиеДокументовУчетаГСМвБУ.ПолучитьРезультатЗапросаОперации(ПараметрыПроцедуры);
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции


&НаСервере
Функция ПолучитьСпискокДокументов()
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам КАК CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам
	               |ГДЕ
	               |	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам.Дата МЕЖДУ &Начало И &Окончание
	               |	И CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам.Проведен";
	
	Запрос.УстановитьПараметр("Начало", ПериодФормирования.ДатаНачала);
	Запрос.УстановитьПараметр("Окончание", ПериодФормирования.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивДокументов = новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Если МассивДокументов.Найти(Выборка.Ссылка) = Неопределено Тогда
			МассивДокументов.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьОповещения()
	
	МассивДокументов = ПолучитьСпискокДокументов();
	Если МассивДокументов.Количество() > 0 тогда
		Для Каждого СтрокаМассива из МассивДокументов Цикл
			
			ТекстОповещения	= "Необходимо переформировать документ:";
			ТекстПояснения	= Строка(СтрокаМассива);
			ПоказатьОповещениеПользователя(ТекстОповещения, ПолучитьНавигационнуюСсылку(СтрокаМассива), ТекстПояснения,БиблиотекаКартинок.CW_Документ, СтатусОповещенияПользователя.Важное);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
